app/views/shared/_footer.html.erb

SELECT 1 AS one FROM "welcomes" LIMIT $1  [["LIMIT", 1]]
---

<% if Welcome.exists? %>