app/controllers/loans_controller.rb

SELECT "packages".* FROM "packages" ORDER BY created_at ASC
---
  def index
    @users = User.where(user_id: current_user)
    @plans = Plan.all
    @transactions = Transaction.where(user_id: current_user).order('created_at DESC')
    @transfers = Transfer.where(user_id: current_user).order('created_at DESC')
    @loans = Loan.where(user_id: current_user).order('created_at ASC')
    @packages = Package.all.order('created_at ASC')

SELECT "packages".* FROM "packages" ORDER BY created_at ASC
---
  def new
    @plans = Plan.all
    @loan = current_user.loans.build
    @packages = Package.all.order('created_at ASC')